ToniHG/TFM_STM_TF/tfm_master_stm32f429i/Core/Src/main.c
  CAN_RxHeaderTypeDef rx_header;
  uint8_t rx_data[8];
  rtos_can_msg_t incoming_msg;
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;

  /* Get the received message from the CAN peripheral */
  if (HAL_CAN_GetRxMessage(hcan, CAN_RX_FIFO0, &rx_header, rx_data) == HAL_OK) {
    /* Safe slave id*/
    incoming_msg.sender_id = rx_header.StdId;
    memcpy(&incoming_msg.frame, rx_data, sizeof(can_frame_payload_t));
    /* Send the received message to the FreeRTOS queue */
    xQueueSendFromISR(can_rx_queue, &incoming_msg, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
  }
}

/**
 * @brief  Callback de interrupción: Confirma que el envío terminó con éxito
 */
void HAL_CAN_TxMailbox0CompleteCallback(CAN_HandleTypeDef *hcan) {
    // Aquí puedes poner un toggle de un LED verde para saber que el cableado está bien
}

/**
 * @brief  Task of FreeRTOS to process received CAN messages and apply Fault Tolerance treatment
 * @param  argument: Not used, but it's a pointer that you could use to pass data to the task if you wanted
 * @retval None
 */
void Task_ProcessData(void *argument) {
  /* Data to process from Queue */
  rtos_can_msg_t msg_to_process;

  while(1) {
    if (xQueueReceive(can_rx_queue, &msg_to_process, 0) == pdPASS) {
      /* Process the message with the Fault Tolerance library to check CRC and sequence */
      last_msg_status = ft_process_message(&msg_to_process.frame, msg_to_process.sender_id);
        
      /* Treatment of fault conditions */
      if (last_msg_status == FT_SYNC_REQUIRED) {
        CAN_Safe_Transmit(msg_to_process.sender_id, 0, MSG_TYPE_SYNC_REQUIRED);
      }
      else if (last_msg_status == FT_ERR_CRC_FAILED) {
        //TODO: Possible future improvement: Treatment of CRC errors (Count consecutive CRC errors are being treated in fault tolerance library, so you could check that count here and decide to mute a node if it exceeds a threshold)
      }
    }
    vTaskDelay(pdMS_TO_TICKS(50));
  }
}

/**
 * @brief  Functions to print text on the LCD at specific coordinates (for simplicity, we use a basic function that prints character by character)
 * @param  x: X coordinate on the LCD
 * @param  y: Y coordinate on the LCD
 * @param  text: Text to print
 * @retval None
 */
void print_at_anyfont(uint16_t x, uint16_t y, char* text) {
    int i = 0;
    uint16_t font_width = BSP_LCD_GetFont()->Width;
    
    while(text[i] != '\0') {
        BSP_LCD_DisplayChar(x + (i * font_width), y, text[i]);
        i++;
    }
}

/**
 * @brief  Function to reset the context of a slave node 
 * @param  index: Index of the slave node whose context needs to be reset
 * @retval None
 */
void Reset_Slave_Context(uint8_t index) {
  slave_contexts[index].is_muted = !slave_contexts[0].is_muted;
  slave_contexts[index].stats_crc_errors = 0;
  slave_contexts[index].stats_frames_lost = 0;
  slave_contexts[index].stats_frames_ok = 0;
  slave_contexts[index].consecutive_crc_errors = 0;
  slave_contexts[index].consecutive_seq_errors = 0;
  slave_contexts[index].sync_attempts = 0;
  slave_contexts[index].expected_seq_num = 0;
  slave_contexts[index].last_valid_data = 0;
  if (!slave_contexts[0].is_muted) {
    // If we are unmuting the node, we can also send a SYNC_REQUIRED message to ask it to resync immediately
    CAN_Safe_Transmit(slave_contexts[index].slave_id, 0, MSG_TYPE_SYNC_REQUIRED);
  }
}

/**
 * @brief  Task de FreeRTOS para actualizar la pantalla
 * @param  argument: No se usa, pero es un puntero que podrías usar para pasar datos a la tarea si quisieras
 * @retval None
 */
void Task_UpdateDisplay(void *argument) {
  char txt[40];
  TS_StateTypeDef TS_State;

  while(1) {
    /* Check touch state */
    BSP_TS_GetState(&TS_State);
    
    if (TS_State.TouchDetected) {
        uint16_t x = TS_State.X;
        uint16_t y = TS_State.Y;

        if (actual_display == DISPLAY_MAIN) {
          /* Take action based on touch coordinates */
          if (x < 120 && y > 160) { actual_display = DISPLAY_NODE_1; update_display = 1; }
          else if (x > 120 && y > 160) { actual_display = DISPLAY_NODE_2; update_display = 1; }
          else if (x < 120 && y < 160) { actual_display = DISPLAY_NODE_3; update_display = 1; }
          else if (x > 120 && y < 160) { actual_display = DISPLAY_CONTROL; update_display = 1; }
        } 
        else {
          /* If submenus check for return button */
          if (50 > y) { 
              actual_display = DISPLAY_MAIN; 
              update_display = 1; 
          }
          /* Check for control panel interactions */
          else if (actual_display == DISPLAY_CONTROL) {
            if (y > 60 && y < 110) { 
              Reset_Slave_Context(3);
            }
            else if (y > 120 && y < 170) { 
              Reset_Slave_Context(2);
            }
            else if (y > 180 && y < 230) { 
              Reset_Slave_Context(1);
            }
          }
        }
        /* To avoid excessive CPU usage */
        vTaskDelay(pdMS_TO_TICKS(250)); 
    }
    /* Render of menus */
    if (update_display) {
        BSP_LCD_Clear(LCD_COLOR_WHITE);      
        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
        if (actual_display == DISPLAY_MAIN) {
          /* Render main menu */
          BSP_LCD_SetTextColor(LCD_COLOR_DARKGRAY);
          BSP_LCD_DrawLine(120, 0, 120, 320);
          BSP_LCD_DrawLine(0, 160, 240, 160);

          BSP_LCD_SetFont(&Font16);
          BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
          print_at_anyfont(15, 60, "SLAVE 1");
          print_at_anyfont(135, 60, "SLAVE 2");
          print_at_anyfont(15, 220, "SLAVE 3");
          BSP_LCD_SetTextColor(LCD_COLOR_RED);
          print_at_anyfont(135, 220, "PANNEL");
          print_at_anyfont(135, 240, "CONTROL");
        }
        else {
          /* Render back button */
          BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
          BSP_LCD_FillRect(0, 280, 240, 40); 
          BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
          BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
          BSP_LCD_SetFont(&Font16);
          print_at_anyfont(60, 292, "[ < BACK ]");
          BSP_LCD_SetBackColor(LCD_COLOR_WHITE); 
          BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        }
        update_display = 0; 
    }

